# 调整方案
fundsList = [{
  "code": "002656", # 基金代码
  "name": "南方创业板ETF联接A", # 基金名称
  "rate": 0.03, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "160119", # 基金代码
  "name": "南方中证500ETF联接(LOF)A", # 基金名称
  "rate": 0.06, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "163407", # 基金代码
  "name": "兴全沪深300增强A", # 基金名称
  "rate": 0.15, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "164906", # 基金代码
  "name": "交银中证海外中国互联网指数(LOF)A", # 基金名称
  "rate": 0.03, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "000942", # 基金代码
  "name": "广发信息技术联接A", # 基金名称
  "rate": 0.03, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "013302", # 基金代码
  "name": "招商中证科创创业50ETF联接A", # 基金名称
  "rate": 0.03, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "001180", # 基金代码
  "name": "广发医药卫生联接A", # 基金名称
  "rate": 0.03, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "003318", # 基金代码
  "name": "景顺长城中证500行业中性低波动指数A", # 基金名称
  "rate": 0.09, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "090010", # 基金代码
  "name": "大成中证红利指数A", # 基金名称
  "rate": 0.15, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "007169", # 基金代码
  "name": "易方达中债1-3年国开行债券指数A", # 基金名称
  "rate": 0.1, # 投资组合中基金的占比
  "purchaseFee": 0.0004, # 购买手续费
  "sellFee": 0, # 卖出手续费
},{
  "code": "000191", # 基金代码
  "name": "富国信用债债券A", # 基金名称
  "rate": 0.1, # 投资组合中基金的占比
  "purchaseFee": 0.0008, # 购买手续费
  "sellFee": 0.001, # 卖出手续费
},{
  "code": "040046", # 基金代码
  "name": "华安纳斯达克100ETF联接QDII", # 基金名称
  "rate": 0.04, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0, # 卖出手续费
},{
  "code": "050025", # 基金代码
  "name": "博时标普500ETF联接QDII", # 基金名称
  "rate": 0.1, # 投资组合中基金的占比
  "purchaseFee": 0.0012, # 购买手续费
  "sellFee": 0.005, # 卖出手续费
},{
  "code": "100050", # 基金代码
  "name": "富国全球债券QDII", # 基金名称
  "rate": 0.06, # 投资组合中基金的占比
  "purchaseFee": 0.0008, # 购买手续费
  "sellFee": 0.003, # 卖出手续费
}]